In [1]:
import numpy as np
from pandas import DataFrame

In [2]:
dframe = DataFrame(np.arange(12).reshape((3,4)),
                   index=['NY','LA','SF'],
                   columns=['A','B','C','D'])

In [3]:
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [4]:
str.lower('A')

'a'

In [5]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [6]:
dframe.index = dframe.index.map(str.lower)

In [7]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [8]:
str.title('udemy is good')

'Udemy Is Good'

In [9]:
dframe.rename(index=str.title, columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [10]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [11]:
dframe.rename(index={'ny': 'NEW YORK'},
              columns={'A': 'ALPHA'})

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [12]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [13]:
dframe.rename(index={'ny': 'NEW YORK'},
              columns={'A': 'ALPHA'}, inplace=True)

In [14]:
dframe

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11